In [172]:
import pandas as pd
import numpy as np

data = [[1, '2020-01-01'], 
        [2, '2020-01-02'], 
        [12, '2020-01-01'], 
        [19, '2020-01-03'], 
        [1, '2020-01-02'], 
        [2, '2020-01-03'], 
        [1, '2020-01-04'], 
        [7, '2020-01-11'], 
        [9, '2020-01-25'], 
        [8, '2020-01-28']]
visits = pd.DataFrame(data, 
                      columns=['user_id', 
                               'visit_date']).astype({'user_id':'Int64', 
                                                      'visit_date':'datetime64[ns]'})
data = [[1, '2020-01-02', 120], 
        [2, '2020-01-03', 22], 
        [7, '2020-01-11', 232], 
        [1, '2020-01-04', 7], 
        [9, '2020-01-25', 33], 
        [9, '2020-01-25', 66], 
        [8, '2020-01-28', 1], 
        [9, '2020-01-25', 99]]
transactions = pd.DataFrame(data, 
                            columns=['user_id', 
                                     'transaction_date', 
                                     'amount']).astype({'user_id':'Int64', 
                                                        'transaction_date':'datetime64[ns]', 
                                                        'amount':'Int64'})
display(visits, transactions)

   user_id visit_date
0        1 2020-01-01
1        2 2020-01-02
2       12 2020-01-01
3       19 2020-01-03
4        1 2020-01-02
5        2 2020-01-03
6        1 2020-01-04
7        7 2020-01-11
8        9 2020-01-25
9        8 2020-01-28

   user_id transaction_date  amount
0        1       2020-01-02     120
1        2       2020-01-03      22
2        7       2020-01-11     232
3        1       2020-01-04       7
4        9       2020-01-25      33
5        9       2020-01-25      66
6        8       2020-01-28       1
7        9       2020-01-25      99

In [173]:
df = visits.merge(transactions, 
                  how="left",
                  left_on=["user_id", "visit_date"],
                  right_on=["user_id", "transaction_date"])
display(df)

    user_id visit_date transaction_date  amount
0         1 2020-01-01              NaT    <NA>
1         2 2020-01-02              NaT    <NA>
2        12 2020-01-01              NaT    <NA>
3        19 2020-01-03              NaT    <NA>
4         1 2020-01-02       2020-01-02     120
5         2 2020-01-03       2020-01-03      22
6         1 2020-01-04       2020-01-04       7
7         7 2020-01-11       2020-01-11     232
8         9 2020-01-25       2020-01-25      33
9         9 2020-01-25       2020-01-25      66
10        9 2020-01-25       2020-01-25      99
11        8 2020-01-28       2020-01-28       1

In [174]:
df = df.groupby(["user_id", "visit_date"])["transaction_date"].count().reset_index(name = 'transactions_count')

df

   user_id visit_date  transactions_count
0        1 2020-01-01                   0
1        1 2020-01-02                   1
2        1 2020-01-04                   1
3        2 2020-01-02                   0
4        2 2020-01-03                   1
5        7 2020-01-11                   1
6        8 2020-01-28                   1
7        9 2020-01-25                   3
8       12 2020-01-01                   0
9       19 2020-01-03                   0

In [175]:
df = df.groupby('transactions_count').size().reset_index(name = 'visits_count')
display(df)

   transactions_count  visits_count
0                   0             4
1                   1             5
2                   3             1

In [176]:
df_zero = pd.DataFrame({"transactions_count": range(0, all_data['transactions_count'].max() + 1)})

df_zero

   transactions_count
0                   0
1                   1
2                   2
3                   3

In [177]:
df = df_zero.merge(all_data, on = 'transactions_count', how = 'left').fillna(0)

df

   transactions_count  visits_count
0                   0           4.0
1                   1           5.0
2                   2           0.0
3                   3           1.0

References: [1] https://leetcode.com/problems/number-of-transactions-per-visit/?lang=pythondata